app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @lists = List.all

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @list = List.find(params[:id])